<template>
	<view class="public-phone">
		<view class="size32">{{ title }}</view>
		<!-- 
			共享平台-服屋-C端-APP

			项目介绍：一款提供服务人员为酒店提供清洁、维修等服务的接单App。由B端小程序酒店发单，服务人员在C端进行接单、签到、查看房间详情、上传打扫信息、联系酒店等功能

			独立负责C端App前端开发，以及B端(小程序)静态页面开发
			运用Vue-Cli搭建搭建uniapp项目框架，引入VueX
			运用uniapp(Vue2)开发APP(目前一期项目安卓版本已交付，准备上架中)

			主要功能：
				1. 上传证件正反面获取用户信息，并进行人脸核验(使用live-pusher实现)
				2. 用户可通过手机号登录、账号密码登录、人脸识别登录(若存在多账户，进入账户列表选择登录账户)
				3. 用户获取用户地理位置签到进行接单
				4. 用户可在列表页或详情页进行接单，并且可在设置时间以及次数内取消订单
				5. 订单卡片以及详情页各种状态的实现
				6. 用户可点击按钮调起手机电话功能联系酒店，用户可点击按钮打开对应酒店位置的外置导航app
				7. 用户需在订单酒店范围内进行订单打卡，才可上传打扫后的房间照片完成任务(未上传前数据存在本地缓存中Storage)
				8. 用户订单打卡可通过人脸识别打卡、支付密码打卡
				9. 用户可在完成的订单详情页针对酒店提起申诉
				10. 用户可通过姓名+手机号绑定支付宝账户
				11. 用户可在我的钱包页面，查看可用余额、冻结余额以及余额变动明细等信息
				12. 用户可提现对应的余额到支付宝账户
				13. 用户可修改支付密码、登录密码、接单城市等信息
				14. 版本更新功能的实现
				15. 公共方法的封装(如格式化时间、倒计时)以及各种共有逻辑的整理(通过mixins)

			组件：
				1. 自定义选择城市组件：
					a. 依据城市首字母分割成不同的列表
					b. 可通过头部搜索进行城市查询(首字母、城市名称包含字符)
					c. 可通过右侧字母直接导肮到对应的首字母列表位置

				2. 工单、订单头部搜索、筛选、排序模块的封装
					a. 用户可通过名称、地址进行搜索
					b. 用户可通过截止时间进行筛选
					c. 用户可通过默认(加急+创建时间)、价格、打扫时间、截单时间进行排序
				
				3. 订单卡片:
					a. 工单数据展示(时间、名称、地址、价格)，若为订单，显示对应的订单状态
					b. 各种按钮的功能实现(接单、导航、打电话、打卡、上传照片)


		 -->
	</view>
</template>

<script>
export default {
	data() {
		return {
			title: 'Hello'
		}
	},
	onLoad() {

	},
	methods: {

	}
}
</script>

<style></style>
